{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 200], "name": "input_2", "dtype": "int32"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"output_dim": 300, "batch_input_shape": [null, 200], "dtype": "float32", "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 200, "mask_zero": false, "name": "embedding_1", "embeddings_regularizer": null, "trainable": false, "input_dim": 168831, "embeddings_constraint": null, "activity_regularizer": null}, "class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"return_state": false, "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 10, "implementation": 1, "activity_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "name": "lstm_1", "return_sequences": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"return_state": false, "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 2, "implementation": 1, "activity_regularizer": null, "bias_regularizer": null, "dropout": 0.0, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "name": "lstm_2", "return_sequences": false, "recurrent_constraint": null, "stateful": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null}, "class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model"}