{"config": {"layers": [{"config": {"dtype": "int32", "sparse": false, "batch_input_shape": [null, 200], "name": "input_3"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"input_dim": 168831, "activity_regularizer": null, "input_length": 200, "embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 200], "mask_zero": true, "output_dim": 300, "embeddings_constraint": null, "trainable": false, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding_1"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "go_backwards": false, "recurrent_regularizer": null, "use_bias": true, "dropout": 0.5, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 1, "activity_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "stateful": false, "bias_constraint": null, "return_state": false, "units": 50, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_dropout": 0.2, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_5"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_5", "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "go_backwards": false, "recurrent_regularizer": null, "use_bias": true, "dropout": 0.5, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "unit_forget_bias": true, "implementation": 1, "activity_regularizer": null, "unroll": false, "return_sequences": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "stateful": false, "bias_constraint": null, "return_state": false, "units": 10, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_dropout": 0.2, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_6"}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]], "name": "lstm_6", "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "units": 6, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_3", 0, 0]], "name": "model_2"}, "keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model"}